Revit 2024 API
NumberingSchema.GetSchemasInDocument Method
 Returns a set of Ids of all Numbering Schema elements for a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static ISet<ElementId> GetSchemasInDocument(
	Document document
)
Visual Basic
Public Shared Function GetSchemasInDocument ( _
	document As Document _
) As ISet(Of ElementId)
Visual C++
public:
static ISet<ElementId^>^ GetSchemasInDocument(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 A document to get numbering schema from.
Return Value
 Ids of NumberingSchema elements. An empty set if no schemas are found in the given document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace